## Importación de librerias

In [13]:
import pandas as pd
pd.set_option('display.max_columns', None)

## Carga de datos

In [9]:
df_bank = pd.read_csv('../bank-additional.csv', index_col=0)

In [10]:
df_bank.head()

,age,job,marital,education,default,housing,loan,contact,duration,campaign,...,emp.var.rate,cons.price.idx,cons.conf.idx,euribor3m,nr.employed,y,date,latitude,longitude,id_
0,NaN,housemaid,MARRIED,basic.4y,0.0,0.0,0.0,telephone,261,1,...,1.1,"93,994","-36,4","4,857",5191,no,2-agosto-2019,41.495,-71.233,089b39d8-e4d0-461b-87d4-814d71e0e079
1,57.0,services,MARRIED,high.school,NaN,0.0,0.0,telephone,149,1,...,1.1,"93,994","-36,4",NaN,5191,no,14-septiembre-2016,34.601,-83.923,e9d37224-cb6f-4942-98d7-46672963d097
2,37.0,services,MARRIED,high.school,0.0,1.0,0.0,telephone,226,1,...,1.1,"93,994","-36,4","4,857",5191,no,15-febrero-2019,34.939,-94.847,3f9f49b5-e410-4948-bf6e-f9244f04918b
3,40.0,admin.,MARRIED,basic.6y,0.0,0.0,0.0,telephone,151,1,...,1.1,"93,994","-36,4",NaN,5191,no,29-noviembre-2015,49.041,-70.308,9991fafb-4447-451a-8be2-b0df6098d13e
4,56.0,services,MARRIED,high.school,0.0,0.0,1.0,telephone,307,1,...,1.1,"93,994","-36,4",NaN,5191,no,29-enero-2017,38.033,-104.463,eca60b76-70b6-4077-80ba-bc52e8ebb0eb

## Selección de columnas

### Eliminar duplicados

In [ ]:
df_bank.duplicated().sum()

# Como podemos ver no existen duplicados.

np.int64(0)

## Limpieza de datos

In [17]:
df_bank.columns

Index(['age', 'job', 'marital', 'education', 'default', 'housing', 'loan',
       'contact', 'duration', 'campaign', 'pdays', 'previous', 'poutcome',
       'emp.var.rate', 'cons.price.idx', 'cons.conf.idx', 'euribor3m',
       'nr.employed', 'y', 'date', 'latitude', 'longitude', 'id_'],
      dtype='object')

### Columna `age`

In [24]:
print(f"El número de valores nulos en la columna age es: {df_bank['age'].isna().sum()}")

El número de valores nulos en la columna age es: 5120

In [35]:
print(f"El tanto porciento de valores nulos en la columna age es: {df_bank['age'].isna().mean().round(2)*100}")

El tanto porciento de valores nulos en la columna age es: 12.0

In [66]:
print(f"La media de la columna age es: {df_bank['age'].mean().round(2)}%")

La media de la columna age es: 39.98%

In [71]:
umbral_edad_inferior = 40
print(f"El número de personas por debajo de los 40 años es: {(df_bank['age'] < umbral_edad_inferior).sum()}")
print(f"El número de personas por encima de los 40 años es: {(df_bank['age'] > umbral_edad_inferior).sum()}")
print(f"El número total de personas es: {(df_bank['age'] < umbral_edad_inferior).sum() + (df_bank['age'] > umbral_edad_inferior).sum()}")

El número de personas por debajo de los 40 años es: 20875
El número de personas por encima de los 40 años es: 15938
El número total de personas es: 36813

### Columna `date`

In [72]:
df_bank['date'].isna().sum()

np.int64(248)